app/views/movies/index.html.erb

SELECT COUNT(*) FROM "reviews" WHERE "reviews"."movie_id" = ?  [["movie_id", 1]]
---
          <h2><%= link_to movie.title, movie %> (<%= movie.released_on.year %>)
          <small><%= link_to pluralize(movie.reviews.size, 'review'), movie_reviews_path(movie) %></small>