app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("name", "stars", "comment", "movie_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
	def create
		@review = @movie.reviews.new(param_review)
		if @review.save

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
---
	def set_review
		@movie = Movie.find(params[:movie_id])