app/views/reviews/index.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = ?  [["movie_id", 1]]
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."movie_id" = ?  [["movie_id", 1]]
---
  <h1>Reviews for <%= link_to(@movie.title, @movie) %>
  	<small><%= link_to pluralize(@movie.reviews.size, 'review'), movie_reviews_path(@movie) %></small>